fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ГрафикОтпусков</registerRecords>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МаксимальноеЧислоДней = Константы.ВКМ_МаксимальноеЧислоДнейОтпуска.Получить();
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ЗаполнитьСотрудников(Команда)
	
		ЗаполнитьСотрудниковНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда)
	
		Адрес = ПоместитьДанныеВоВременноеХранилище();
	
	Если Адрес <> Неопределено И ЗначениеЗаполнено(Адрес) Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Адрес",Адрес);
		ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
	КонецЕсли;
	
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()
		
	УсловноеОформление.Элементы.Очистить();
	Объект.ОтпускаСотрудников.Очистить();
	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ФизическиеЛица.Ссылка
		|ИЗ
		|	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.ОтпускаСотрудников.Добавить().Сотрудник = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры



&НаСервере
Функция ПоместитьДанныеВоВременноеХранилище()
	
	СтруктураДанных = Новый Структура;
	ДанныеТаблицы = Объект.ОтпускаСотрудников.Выгрузить();
	СтруктураДанных.Вставить("ДанныеТаблицы", ДанныеТаблицы);
	СтруктураДанных.Вставить("Год", Объект.Год);
	Адрес = ПоместитьВоВременноеХранилище(СтруктураДанных);
	Возврат Адрес;
	
КонецФункции


#КонецОбласти
